# GetReportsFolderParsed Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..GetReportsFolderParsed Method
EnergyDataSettings Class See Also
---
Gets the absolute reports folder path that is parsed from the original input.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public string GetReportsFolderParsed()
```

Visual Basic
---
```text
Public Function GetReportsFolderParsed As String
```

Visual C++
---
```text
public:
String^ GetReportsFolderParsed()
```

# ### Return Value
The reports folder path after parsing the input string.
# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace